Repository: instant-crush/stack
Catalog: dart/libs/l10n/lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ja, ko, ru, zh_hans, zh_hant

# labels
source: {code, select, ar{Arabic} de{German} en{English} es{Spanish} fr{French} it{Italian} ja{Japanese} ko{Korean} ru{Russian} zhHans{Simplified Chinese} zhHant{Traditional Chinese} other{}}
ar: {code, select, ar{عربي} de{ألمانية} en{إنجليزي} es{الأسبانية} fr{فرنسي} it{الايطالية} ja{اليابانية} ko{اليابانية} ru{الروسية} zhHans{الصينية المبسطة} zhHant{الصينية التقليدية} other{}}
de: {code, select, ar{Arabisch} de{Deutsch} en{Englisch} es{Spanisch} fr{Französisch} it{Italienisch} ja{Japanisch} ko{Koreanisch} ru{Russisch} zhHans{Vereinfachtes Chinesisch} zhHant{Traditionelles Chinesisch} other{}}
es: {code, select, ar{Arábica} de{Alemán} en{Inglés} es{Español} fr{Francés} it{Italiano} ja{Japonés} ko{Coreano} ru{Ruso} zhHans{Chino Simplificado} zhHant{Chino Tradicional} other{}}
fr: {code, select, ar{Arabe} de{Allemand} en{Anglais} es{Espagnol} fr{Français} it{Italien} ja{Japonais} ko{Coréen} ru{Russe} zhHans{Chinois Simplifié} zhHant{Chinois Traditionnel} other{}}
it: {code, select, ar{Arabo} de{Tedesco} en{Inglese} es{Spagnolo} fr{Francese} it{Italiano} ja{Giapponese} ko{Coreano} ru{Russo} zhHans{Cinese Semplificato} zhHant{Cinese Tradizionale} other{}}
ja: {code, select, ar{アラビア語} de{ドイツ人} en{英語} es{スペイン語} fr{フランス語} it{イタリアの} ja{日本語} ko{韓国語} ru{ロシア} zhHans{簡体字中国語} zhHant{繁体字中国語} other{}}
ko: {code, select, ar{아라비아 말} de{독일 사람} en{영어} es{스페인의} fr{프랑스 국민} it{이탈리아 사람} ja{일본어} ko{한국인} ru{러시아인} zhHans{중국어 간체} zhHant{중국어 번체} other{}}
ru: {code, select, ar{Aрабский} de{Немецкий} en{Английский} es{Uспанский} fr{Французский} it{Uтальянский} ja{Японский} ko{Корейский} ru{Русский} zhHans{Yпрощенный Kитайский} zhHant{Tрадиционный Kитайский} other{}}
zh_hans: {code, select, ar{阿拉伯语} de{德语} en{英语} es{西班牙语} fr{法语} it{意大利语} ja{日语} ko{韩语} ru{俄语} zhHans{简体中文} zhHant{繁体中文} other{}}
zh_hant: {code, select, ar{阿拉伯語} de{德語} en{英語} es{西班牙語} fr{法語} it{意大利語} ja{日語} ko{韓語} ru{俄語} zhHans{簡體中文} zhHant{正體中文} other{}}

# placeholder
source: Hello {userName}
ar: مرحبًا {userName}
de: Hallo {userName}
es: Hola {userName}
fr: Bonjour {userName}
it: Ciao {userName}
ja: こんにちは {userName}
ko: 안녕하세요 {userName}
ru: Привет {userName}

# plurals
source: remaining {count, plural, =0{0 seconds} =1{1 second} other{{count}seconds}}
ar: متبقي {count, plural, =0{0 ثواني} other{{count}ثانية}}
de: übrig {count, plural, =0{0 Sekunden} =1{1 Sekunde} other{{count}Sekunden}}
es: restante {count, plural, =0{0 segundos} =1{1 segundo} other{{count}segundos}}
fr: restant {count, plural, =0{0 secondes} =1{1 seconde} other{{count}secondes}}
it: residuo {count, plural, =0{0 secondi} =1{1 secondo} other{{count}secondi}}
ja: 残り {count, plural, other{{count}秒}}
ko: 남은 {count, plural, other{{count}초}}
ru: оставшийся {count, plural, =0{0 секунд} =1{1 секунда} other{{count}секунды}}
zh_hans: 剩余 {count, plural, other{{count}秒}}
zh_hant: 剩餘 {count, plural, other{{count}秒}}

# genderButtonText
source: click to choice
ar: انقر للاختيار
de: Klicken Sie zur Auswahl
es: haga clic para elegir
fr: cliquez pour choisir
it: clicca per scegliere
ja: クリックして選択
ko: 클릭하여 선택
ru: нажмите, чтобы выбрать
zh_hans: 点击选择
zh_hant: 點擊選擇

# genders
source: {gender, select, male{male} female{female} other{unknown}}
ar: {gender, select, male{ذكر} female{أنثى} other{مجهول}}
de: {gender, select, male{männlich} female{weiblich} other{Unbekannt}}
es: {gender, select, male{masculino} female{femenino} other{desconocido}}
fr: {gender, select, male{mâle} female{femelle} other{inconnu}}
it: {gender, select, male{maschio} female{femmina} other{sconosciuto}}
ja: {gender, select, male{男} female{女性} other{未知}}
ko: {gender, select, male{남성} female{여성} other{알려지지 않은}}
ru: {gender, select, male{мужской} female{женский} other{неизвестный}}
zh_hans: {gender, select, male{男性} female{女性} other{未知}}
zh_hant: {gender, select, male{男性} female{女性} other{未知}}

# gender
source: Sex: {gender, select, male{Boy} female{Girl} other{Prefer not to say}}
ar: الجنس: {gender, select, male{ولد} female{بنت} other{افضل عدم القول}}
de: Sex: {gender, select, male{Junge} female{Mädchen} other{Mache lieber keine Angabe}}
es: Sexo: {gender, select, male{Chico} female{Chica} other{Prefiero no decirlo}}
fr: Sexe: {gender, select, male{Garçon} female{Fille} other{Je préfère ne pas le dire}}
it: Sesso: {gender, select, male{Ragazzo} female{Ragazza} other{Preferisco non dirlo}}
ja: セックス: {gender, select, male{男の子} female{女の子} other{どちらかというと言いたくない}}
ko: 섹스: {gender, select, male{소년} female{소녀} other{말하지 않는 것을 선호}}
ru: Секс: {gender, select, male{Мальчик} female{Девочка} other{Предпочитаю не говорить}}
zh_hans: 性別: {gender, select, male{男生} female{女孩} other{宁愿不说}}
zh_hant: 性別: {gender, select, male{男生} female{女孩} other{寧願不說}}

# datetimeDateButtonText
source: Click to select a date
ar: انقر لتحديد التاريخ
de: Klicken Sie, um ein Datum auszuwählen
es: Haga clic para seleccionar una fecha
fr: Cliquez pour sélectionner une date
it: Fare clic per selezionare una data
ja: クリックして日付を選択します
ko: 날짜를 선택하려면 클릭하세요.
ru: Нажмите, чтобы выбрать дату
zh_hans: 点击选择日期
zh_hant: 點擊選擇日期

# datetimeTimeButtonText
source: Click to select time
ar: انقر لتحديد الوقت
de: Klicken Sie, um die Zeit auszuwählen
es: Haga clic para seleccionar el tiempo
fr: Cliquez pour sélectionner l'heure
it: Fare clic per selezionare l'ora
ja: クリックして時間を選択します
ko: 클릭하여 시간 선택
ru: Нажмите, чтобы выбрать время
zh_hans: 点击选择时间
zh_hant: 點擊選擇時間

# iphone14Pro
source: The ultimate iPhone.
ar: iPhone على أعلى مستوى.
de: Das ultimative iPhone.
es: El iPhone definitivo.
fr: L’iPhone ultime.
it: Il massimo degli iPhone.
ja: 究極のiPhone。
ko: 궁극의 iPhone.
ru: Найдосконаліший iPhone.
zh_hans: iPhone 巅峰之作
zh_hant: iPhone 的極致。

# iphone14ProPrice
source: From {price}
ar: ابتداءً من {price}
de: Ab {price}
es: Desde {price}
fr: À partir de {price}
it: A partire da {price}
ja: {price}（税込）から
ko: {price}부터
ru: от {price}

# iphone14ProPriceInstallments
source: {installments}/mo for 24 mo.
de: {installments}/Monat
es: {installments}/mes
it: {installments} al mese
ja: 下取りがない場合は36回 払いで{installments}円/月
zh_hans: {installments}/月

# iphone14ProBuy
source: Buy
ar: اشتر
de: Kaufen
es: Comprar
fr: Acheter
it: Acquista
ja: 購入
ko: 구입하기
ru: Купити
zh_hans: 购买
zh_hant: 購買

# iphone14ProDisplayTitle
source: 6.7″ or 6.1″
ar: 6.7 إنش أو 6.1 إنش
de: 6,7" oder 6,1"
es: 6,7″ o 6,1″
fr: 6,7″ ou 6,1″
it: 6,7" o 6,1"
ja: 6.7インチまたは6.1インチ
ko: 17.0cm 또는 15.5cm
ru: 6,7″ або 6,1″
zh_hans: 6.7 或 6.1 英寸
zh_hant: 6.7 吋或 6.1 吋

# iphone14ProDisplay
source: Super Retina XDR display ProMotion technology Always-On display
ar: شاشة ريتنا سوبر XDR تكنولوجيا ProMotion شاشة بميزة تشغيل دوماً
de: Super Retina XDR Display ProMotion Technologie Always‑On Display
es: Pantalla Super Retina XDR Tecnología ProMotion Pantalla siempre activa
fr: Écran Super Retina XDR Technologie ProMotion Écran toujours activé
it: Display Super Retina XDR Tecnologia ProMotion Display always‑on
ja: Super Retina XDRディスプレイ ProMotionテクノロジー 常時表示ディスプレイ
ko: Super Retina XDR 디스플레이 ProMotion 기술 상시표시형 디스플레이
ru: Дисплей Super Retina XDR Технологія ProMotion Завжди ввімкнений дисплей
zh_hans: 超视网膜 XDR 显示屏 ProMotion 自适应刷新率 全天候显示
zh_hant: 超 Retina XDR 顯示器 ProMotion 自動適應更新頻率技術 永遠顯示

# iphone14ProDynamicIslandFeatures
source: A new way to interact with iPhone
ar: طريقة جديدة للتفاعل مع iPhone
de: Eine neue Art, mit dem iPhone zu interagieren
es: Una nueva forma de interactuar con el iPhone
fr: Un nouveau mode d’interaction avec l’iPhone
it: Un nuovo modo di interagire con iPhone
ja: 新しいiPhoneの操作システム
ko: iPhone을 다루는 새로운 방식
ru: Новий спосіб взаємодії з iPhone
zh_hans: 和 iPhone 互动的 新方式
zh_hant: 靈活多變的 iPhone 新玩法

# iphone14ProSos
source: Emergency SOS via satellite Emergency SOS Crash Detection
ar: ميزة طوارئ SOS ميزة اكتشاف الاصطدام
de: Notruf SOS über Satellit Notruf SOS Unfall­erkennung
es: Emergencia SOS Detección de accidentes
fr: SOS d’urgence par satellite Appel d’urgence Détection des accidents
it: SOS emergenze via satellite SOS emergenze Rilevamento incidenti
ja: 緊急SOS 衝突事故検出
ko: 긴급 구조 요청 충돌 감지
ru: Сигнал SOS Виявлення аварій
zh_hans: SOS 紧急联络 车祸检测
zh_hant: SOS 緊急服務 車禍偵測功能

# iphone14ProCamera
source: Pro camera system
ar: نظام كاميرات Pro
de: Pro Kamera-System
es: Sistema de cámaras Pro
fr: Système photo pro
it: Sistema di fotocamere Pro
ja: Proのカメラシステム
ko: 프로급 카메라 시스템
ru: Система камер Pro
zh_hans: Pro 级摄像头系统
zh_hant: Pro 相機系統

# iphone14ProCameraFeatures
source: 48MP Main Ultra Wide Telephoto Photonic Engine for incredible detail and color Autofocus on TrueDepth front camera
ar: كاميرا رئيسية 48MP كاميرا واسعة للغاية ميزة تقريب المسافات محرك Photonic Engine لمستوى مذهل من التفاصيل والألوان ضبط تلقائي للعدسة في كاميرا العمق الحقيقي الأمامية
de: 48 MP Hauptkamera Ultraweitwinkel Tele Photonic Engine für unglaubliche Details und Farben Autofokus bei der TrueDepth Frontkamera
es: Principal de 48 Mpx Ultra gran angular Teleobjetivo Photonic Engine para un detalle y color increíbles Cámara frontal TrueDepth con enfoque automático
fr: Objectif principal 48 Mpx Ultra grand‑angle Téléobjectif Photonic Engine pour des couleurs et un niveau de détail impressionnants Mise au point automatique sur la caméra avant TrueDepth
it: Principale (grandangolo) da 48MP, ultra-grandangolo Teleobiettivo Photonic Engine per dettagli e colori incredibili Fotocamera frontale TrueDepth con autofocus
ja: 48MPメイン 超広角 望遠 圧倒的なディテールと色彩のための Photonic Engine オートフォーカスを搭載した TrueDepthフロントカメラ
ko: 48MP 메인 울트라 와이드 망원 놀라운 디테일과 사실적인 색감을 구현하는 Photonic Engine 오토포커스를 지원하는 TrueDepth 전면 카메라
ru: Основна 48 Мп Надширококутна Телефото Photonic Engine для неймовірної деталізації та кольору Автофокус на фронтальній камері TrueDepth
zh_hans: 主摄 4800 万像素 超广角 长焦 光像引擎带来 惊人细节和色彩表现 支持自动对焦的原深感前置摄像头
zh_hant: 4800 萬像素主相機 超廣角 望遠 光像引擎可呈現出色的 細節與色彩 原深感測前置相機 具備自動對焦功能

# iphone14ProActionMode
source: Action mode smooths out shaky handheld videos
ar: نمط الحركة لفيديوهات مصورة باليد كلها سلاسة وثبات
de: Action Modus glättet verwackelte, handgefilmte Videos
es: El modo Acción estabiliza las tomas movidas
fr: Mode Action, pour des vidéos plus stables, même en mouvement
it: Modalità Azione per stabilizzare i video mossi
ja: 手持ちでもなめらかな映像が撮れる アクションモード
ko: 흔들림 없는 핸드헬드 동영상을 촬영할 수 있게 해주는 액션 모드
ru: Режим «Швидкий рух» стабілізує зйомку відео з рук
zh_hans: 运动模式让手持视频拍得又顺又稳
zh_hant: 動作模式 手持拍影片又穩又順

# iphone14ProBattery
source: Up to 29 hours video playback
ar: لغاية 29 ساعة من تشغيل الفيديو
de: Bis zu 29 Std. Video­wiedergabe
es: Hasta 29 horas de reproducción de vídeo
fr: Jusqu’à 29 heures de lecture vidéo
it: Fino a 29 ore di riproduzione video
ja: 最大29時間のビデオ再生
ko: 최대 29시간 동영상 재생
ru: До 29 годин відтворення відео
zh_hans: 视频播放最长可达 29 小时
zh_hant: 影片播放時間 最長可達 29 小時

# iphone14ProChip
source: A16 Bionic chip
ar: شريحة A16 بايونك
es: Chip A16 Bionic
fr: Puce A16 Bionic
it: Chip A16 Bionic
ja: A16 Bionicチップ
ko: A16 Bionic 칩
ru: Чип A16 Bionic
zh_hans: A16 仿生芯片
zh_hant: A16 仿生晶片

# iphone14ProCellular
source: Superfast 5G cellular
ar: شبكة G فائقة السرعة للاتصال الخلوي5
de: Superschneller 5G Mobilfunk
es: Redes 5G ultrarrápidas
fr: Connectivité cellulaire 5G ultra‑rapide­­­
it: Reti cellulari 5G ultrarapide
ja: 超高速の5G携帯電話通信
ko: 초고속 5G 셀룰러
ru: Підтримка 5G
zh_hans: 超快的 5G 蜂窝网络
zh_hant: 超飆速 5G 行動網路

# iphone14ProStorage
source: Storage.
de: Speicherplatz.
es: Modelo.
fr: Stockage.
it: Archiviazione.
ja: ストレージ。
ko: 저장 용량.
zh_hans: 存储容量：
zh_hant: 存储容量：

# iphone14ProStorageInfo
source: How much space do you need?
de: Wie viel Speicherplatz brauchst du?
es: ¿Cuál te conviene?
fr: De combien d’espace avez-vous besoin ?
it: Quanto spazio ti serve?
ja: 必要な容量は？
ko: 당신에게 알맞은 저장 용량은?
zh_hans: 你需要多大的存储空⁠间？
zh_hant: 你需要多大的存储空⁠间？

# iphone14ProStorageItem
source: From{now} or {installments}/mo for 24 mo.
de: {installments}/Monat oder {now}
es: {installments}/mes o {now}
fr: {now}
it: {installments} al mese o {now}
ja: 下取りがない場合は36回 払いで{installments}円/月 または{now}円（税込）
ko: {now}
zh_hans: {installments}/月或 {now}
zh_hant: {now}

# pixel7Pro
source: The all-pro Google phone.
de: Das Google Smartphone auf Pro-Niveau.
es: El teléfono de Google más pro.
fr: Prodigieusement à la pointe.
it: Il telefono Google migliore di sempre.
ja: プロ性能を 突き詰めた Google Pixel。
zh_hant: 極致全能的 Google 手機

# pixel7ProPrice
source: From {price}
de: Ab {price}
es: Desde {price}
fr: À partir de {price}
it: A partire da {price}
ja: {price} より
zh_hant: {price} 起

# pixel7ProPriceSave
source: Save {price}
ja: {price} 引き

# pixel7ProBuy
source: Buy
de: Kaufen
es: Comprar
fr: Acheter
it: Acquista
ja: 購入
zh_hant: 購買

# pixel7ProDisplay
source: QHD+LTPO OLED Smooth Display, up to 120 Hz
de: QHD+LTPO OLED Smooth Display, bis zu 120 Hz
es: Pantalla Fluida OLED QHD+LTPO, hasta 120 Hz
fr: Affichage fluide OLED QHD+LTPO, avec fréquence d'actualisation jusqu'à 120 Hz
it: Display fluido OLED QHD+LTPO, fino a 120 Hz
ja: QHD+LTPO OLED スムーズ ディスプレイ 最大 120 Hz
zh_hant: QHD+LTPO OLED 流暢顯示螢幕 刷新率最高可達 120 Hz

# pixel7ProCamera
source: Triple rear camera system: Wide lens, ultrawide lens, telephoto lens
de: Dreifach-Rückkamerasystem: Weitwinkelobjektiv, Ultraweitwinkelobjektiv, Teleobjektiv
es: Sistema de cámara trasera triple: lente gran angular, lente ultra gran angular, lente teleobjetivo
fr: Triple caméra arrière : Objectif grand angle, objectif ultra grand angle, téléobjectif
it: Sistema a tripla fotocamera posteriore: Obiettivo grandangolare, obiettivo ultrawide, teleobiettivo
ja: トリプル背面カメラシステム: 広角レンズ、ウルトラワイド レンズ、望遠レンズ
zh_hant: 後置三鏡頭系統： 廣角鏡頭、超廣角鏡頭、望遠鏡頭

# pixel7ProBattery
source: 5000 mAh 24+ hour battery life Fast Wireless charging Battery Share
de: 5000 mAh Mehr als 24 Stunden Akkulaufzeit Schnelles kabelloses Laden Battery Share
es: 5000 mAh Más de 24 horas de duración de la batería Carga inalámbrica rápida Compartir Batería
fr: 5000 mAh Plus de 24 heures d'autonomie Recharge sans fil rapide Partage de batterie
it: 5000 mAh Oltre 24 ore di autonomia Ricarica wireless rapida Condividi batteria
ja: 5000 mAh 24 時間以上のバッテリー駆動時間 24 時間以上のバッテリー駆動時間 バッテリー シェア
zh_hant: 5000 mAh 電池續航力超過 24 小時 快速無線充電 電力分享

# pixel7ProAuthenticationTitle
source: Security and authentication
de: Sicherheit und Authentifizierung
es: Seguridad y autenticación
fr: Sécurité et authentification
it: Sicurezza e autenticazione
ja: バッテリー シェア
zh_hant: 安全性和驗證

# pixel7ProAuthentication
source: Titan M2™ chip & security core Fingerprint Unlock Face Unlock VPN by Google One
de: Titan M2™-Chip und Sicherheitskern Entsperrung per Fingerabdruck Entsperrung per Fingerabdruck Gesichtserkennung VPN by Google One
es: Chip Titan M2™ y núcleo de seguridad Desbloqueo con Huella Digital Desbloqueo Facial VPN by Google One
fr: Puce Titan M2™ et noyau de sécurité Déverrouillage par empreinte digitale Déverrouillage par reconnaissance faciale VPN by Google One
it: Chip Titan M2™ e core di sicurezza Sblocco con l'impronta Sblocco con il volto VPN by Google One
ja: Titan M2™ チップとセキュリティ コア 指紋認証 指紋認証 VPN by Google One
zh_hant: Titan M2™ 晶片與安全核心 指紋解鎖 人臉解鎖 VPN by Google One

# pixel7ProStorageTitle
source: Choose your storage space
de: Speicherplatz auswählen
es: Elige tu espacio de almacenamiento
fr: Choisissez votre espace de stockage
it: Scegli il tuo spazio di archiviazione
ja: 保存容量を選択してください
zh_hant: 選擇儲存空間

# pixel7ProPriceInstallments
source: or {price}/month with 36-month financing
de: oder {price}/Monat bei Finanzierung über 24 Monate
zh_hant: 省下 {price}

# iphone14ProDynamicIsland
source: Dynamic Island
zh_hans: 灵动岛功能
zh_hant: 動態島

# iphone14ProAuthentication
source: Face ID
ar: بصمة الوجه
zh_hans: 面容 ID
